Revit 2027 API
UIControlledApplication Properties
The UIControlledApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId |  Get current active external application or external command id.
ControlledApplication | Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
IsLateAddinLoading |  Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.
IsViewerModeActive |  Determines if Revit session is in Viewer mode.
LoadedApplications |  Returns an array of successfully loaded external applications.
MainWindowHandle | Get the handle of the Revit main window.
ProductIsRS |  Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Top
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace